---
kind: type
id: T:Autodesk.Revit.DB.Analysis.MEPAnalyticalSegmentType
source: html/ea9aa24a-b6fe-6cd7-6740-266fc3d168d5.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalSegmentType

The type of analytical segment.

## Syntax (C#)
```csharp
public enum MEPAnalyticalSegmentType
```